src/Catalogs/FL_Messages.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>FL_Messages</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AppId</Name>
					<Comment>Identifier of the application that produced the message.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContentEncoding</Name>
					<Comment>Message content encoding.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContentType</Name>
					<Comment>Message content type.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CorrelationId</Name>
					<Comment>Message correlated to this one.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EventSource</Name>
					<Comment>Provides access to the event source object name.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Operation</Name>
					<Comment>The type of change experienced.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FL_Operations</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReplyTo</Name>
					<Comment>Resource name other apps should send the response to.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Routed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Timestamp</Name>
					<Comment>Timestamp of the moment when message was created.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UserId</Name>
					<Comment>User identifier.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Context</Name>
					<Comment>Serialized invocation data into XML. </Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Filter</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NamespaceURI</Name>
							<Comment>URI of the name space, to which the XML type belongs.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PrimaryKey</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TypeName</Name>
							<Comment>A representation XML data type by XML type name.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>XMLValue</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>AppEndpoints</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Endpoint</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Channels</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Exchange</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Exchanges</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Job</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Jobs</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Exchanges</Name>
					<Comment>List of exchanges.</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Exchange</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Exchanges</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Job</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Jobs</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>SessionContext</Name>
					<Comment>Provides access to the runtime session context.</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>MetadataObject</Name>
							<Comment>Provides access to the metadata object name.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Session</Name>
							<Comment>Semi-permanent interactive information interchange.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ValueStorage</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/HTTPServices/FL_AppEndpoint/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// This file is part of FoxyLink.
// Copyright © 2016-2018 Petro Bazeliuk.
// 
// This program is free software: you can redistribute it and/or modify 
// it under the terms of the GNU Affero General Public License as 
// published by the Free Software Foundation, either version 3 of the License,
// or (at your option) any later version.
//
// This program is distributed in the hope that it will be useful, 
// but WITHOUT ANY WARRANTY; without even the implied warranty of 
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
// GNU Affero General Public License for more details.
//
// You should have received a copy of the GNU Affero General Public License 
// along with FoxyLink. If not, see <http://www.gnu.org/licenses/agpl-3.0>.
//
////////////////////////////////////////////////////////////////////////////////

#Region ProgramInterface

Function MessageHandler(Request)
    
    Var Exchange, Operation, Async, Exec;
    
    ProcessURLParameters(Request.URLParameters, Exchange, Operation, Async, Exec);
    
    Headers = FL_InteriorUse.HeadersFromRequestResponse(Request);
    Invocation = Catalogs.FL_Messages.NewInvocation();
    
    Catalogs.FL_Messages.FillContentTypeFromHeaders(Invocation, Headers);
    
    // Helps to resolve problem with english and russian configurations. 
    Invocation.EventSource = Metadata.HTTPServices.FL_AppEndpoint.Fullname();
    
    Invocation.Operation = Operation;
    Invocation.Payload = Request.GetBodyAsBinaryData(); 
    Invocation.ReplyTo = Headers.Get("REPLYTO");
    Invocation.CorrelationId = Headers.Get("CORRELATIONID");
    
    Timestamp = Headers.Get("TIMESTAMP");
    If ValueIsFilled(Timestamp) Then
        Invocation.Timestamp = Timestamp;
    EndIf;
    
    UserId = Headers.Get("USERID");
    If ValueIsFilled(UserId) Then 
        Invocation.UserId = UserId;
    EndIf;
    
    AppEndpoint = Undefined;
    If ValueIsFilled(Invocation.ReplyTo) Then
        AppEndpoint = FL_CommonUse.ReferenceByDescription(
            Metadata.Catalogs.FL_Channels, Headers.Get("APPID"));
    EndIf;
    
    // Avoid using hierarchical transactions. 
    Invocation.Routed = True;
    Message = Catalogs.FL_Messages.Create(Invocation);
    
    If Async Then
        Catalogs.FL_Messages.Route(Message, Exchange, AppEndpoint, True);
    ElsIf Exec Then
        
        JobResult = Catalogs.FL_Messages.RouteAndRunOutputResult(
            Message, Exchange, AppEndpoint);
            
        OutInvocation = Catalogs.FL_Jobs.GetFromJobResult(
            JobResult, "Invocation");
        
    Else 
        Catalogs.FL_Messages.RouteAndRun(Message, Exchange, AppEndpoint);
    EndIf;
    
    Response = New HTTPServiceResponse(FL_InteriorUseReUse.OkStatusCode());
    
    If Exec Then
        Response.SetBodyFromBinaryData(OutInvocation.Payload);
    EndIf;
    
    Return Response;
    
EndFunction // MessageHandler()

#EndRegion // ProgramInterface

#Region ServiceProceduresAndFunctions

// Only for internal use.
//
Procedure ProcessURLParameters(URLParameters, Exchange, Operation, Async, Exec)
    
    ExchangeName = URLParameters.Get("Exchange");
    Exchange = FL_CommonUse.ReferenceByDescription(
        Metadata.Catalogs.FL_Exchanges, ExchangeName);
    If Exchange = Undefined Then
        
        ErrorMessage = StrTemplate(NStr("
                |en='Error: Exchange settings {%1} not found.'; 
                |ru='Ошибка: Настройки обмена {%1} не найдены.'; 
                |uk='Помилка: Налаштування обміну {%1} не знайдено.';
                |en_CA='Error: Exchange settings {%1} not found.'"),
            ExchangeName);   
        Raise ErrorMessage;
         
    EndIf;
    
    OperationName = URLParameters.Get("Operation");
    Operation = FL_CommonUse.ReferenceByDescription(
        Metadata.Catalogs.FL_Operations, OperationName);
    If Operation = Undefined Then
        
        ErrorMessage = StrTemplate(NStr("
                |en='Error: Operation {%1} not found.'; 
                |ru='Ошибка: Операция {%1} не найдена.'; 
                |uk='Помилка: Операція {%1} не знайдена.';
                |en_CA='Error: Operation {%1} not found.'"),
            OperationName);   
        Raise ErrorMessage;
         
    EndIf;
   
    Async = Upper(URLParameters.Get("Type")) = "ASYNC";
    Exec = Upper(URLParameters.Get("Type")) = "EXEC";
    
EndProcedure // ProcessURLParameters()

#EndRegion // ServiceProceduresAndFunctions
